firstArtilleryPWScenario.yml
# first artillery scenario
# 2 VUsers
# 
config: 
   target: "https://playwright.dev/"
   processor: "./tests/artilleryPlaywright.js"  
   phases:
   - name: constantLoad 
     duration:  10
     arrivalRate: 2
   engines: 
     playwright: 
       launchOptions:
         headless: false
#    processor: "./tests/tryFunction.js"  
    
scenarios: 
  - name: firstArtillery
    engine: playwright
    testFunction: "firstTest"