firstArtilleryScenario.yml
# first artillery scenario
# 2 VUsers
#  API KEy for when we can run remotely a9_0TeJL78cIJCEYXj7TrSyICEzdJz97Mf7
# 
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: "http://asciiart.artillery.io:8080"
  http:
    timeout: 20
    extendedMetrics: true
#   defaults:
#      think: 
#        jitter: 3s

  phases:
     - name: Warm up phase
       duration: 1
       arrivalRate: 2
#      rampTo: 5
  plugins:
    metrics-by-endpoint: {}
    
scenarios:
  - name: firstArtillery
    flow:
      - loop:
          - get:
              url: '/dino'
          - get:
              url: '/pony'
          - get:
              url: '/armadillo'
          - think: 15
        count: 10
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
# plugins:
#     ensure: {}
#     apdex: {}
#     metrics-by-endpoint: {}
# apdex:
#     threshold: 100
# ensure:
#     thresholds:
#       - http.response_time.p99: 100
#       - http.response_time.p95: 75